Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd

In [3]:
df = pd.read_csv('sake.txt')
df

Empty DataFrame
Columns: [I am sake chaitanya .having fun with data scienceS]
Index: []

In [5]:
data={'num':[1,2,3,4],'names':['sake','chay','shiv','mithin'],'study':['btech','mbbs','mba','bcom']}

In [8]:
df=pd.DataFrame(data)

In [9]:
df.head(2)

   num names  study
0    1  sake  btech
1    2  chay   mbbs

In [10]:
df.tail(2)

   num   names study
2    3    shiv   mba
3    4  mithin  bcom

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   num     4 non-null      int64
 1   names   4 non-null      object
 2   study   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [12]:
df.describe()

            num
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [13]:
data1={'A':[1,2,3],'B':['shiv','parvati','ganesh'],'C':['Mahakal','shakthi','educator']}

In [14]:
data1

{'A': [1, 2, 3],
 'B': ['shiv', 'parvati', 'ganesh'],
 'C': ['Mahakal', 'shakthi', 'educator']}

In [16]:
df=pd.DataFrame(data1,index=[1,2,3])

In [17]:
df

   A        B         C
1  1     shiv   Mahakal
2  2  parvati   shakthi
3  3   ganesh  educator

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [43]:
def sumfy(df):
    if 'Values' not in df.columns:
        print('mentioned column not present')
    totalsum=df['Values'].head(3).sum()
    print('sum',totalsum)

In [40]:
data={'Values':[10,20,30,40,50],'Names':['sake','chay','mithin','shiv','nihar']}

In [41]:
df=pd.DataFrame(data)
df

   Values   Names
0      10    sake
1      20    chay
2      30  mithin
3      40    shiv
4      50   nihar

In [44]:
sumfy(df)

sum 60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [45]:
data={'Text':['hey hello','good morning guys','nihar is waste fellow of india']}

In [78]:
df=pd.DataFrame(data)
df

                             Text
0                       hey hello
1               good morning guys
2  nihar is waste fellow of india

In [80]:
def county(Text):
    s=Text.split(' ')
    return len(s)

In [81]:
df['word_count']=df['Text'].apply(county)

In [82]:
df

                             Text  word_count
0                       hey hello           2
1               good morning guys           3
2  nihar is waste fellow of india           6

Q5. How are DataFrame.size() and DataFrame.shape() different?

The size attribute of a DataFrame returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and the number of columns.
The shape attribute of a DataFrame returns a tuple representing the dimensions of the DataFrame. The tuple contains two elements: the number of rows and the number of columns.

Q6. Which function of pandas do we use to read an excel file?

To read an Excel file in pandas, you can use the read_excel() function. This function is specifically designed to read data from Excel files

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [83]:
data={'Email':['nihar@gmail.com','indu@gmail.com','chay@gmail.com']}
df=pd.DataFrame(data)

In [84]:
df

             Email
0  nihar@gmail.com
1   indu@gmail.com
2   chay@gmail.com

In [88]:
def user(Email):
    username=Email.split('@')
    return username[0]

In [89]:
df['username']=df['Email'].apply(user)

In [90]:
df

             Email username
0  nihar@gmail.com    nihar
1   indu@gmail.com     indu
2   chay@gmail.com     chay

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2
Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [1]:
data={'Values':[10,20,30,40,50]}

In [4]:
df=pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [6]:
df['Values'].mean()

30.0

In [7]:
df['Values'].median()

30.0

In [8]:
df['Values'].std()

15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [9]:
data={'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04', '2023-01-05']}
df=pd.DataFrame(data)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [21]:
import pandas as pd

def add_weekday_column(df):
    # Convert 'Date' column to datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Add a new column 'Weekday' containing the weekday names
    df['Weekday'] = df['Date'].dt.day_name()

# Example usage:
# Assuming df is your DataFrame
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
df = pd.DataFrame(data)

add_weekday_column(df)

print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [24]:
import pandas as pd

def select_rows_between_dates(df):
    # Convert 'Date' column to datetime format
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Define the start and end dates
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    
    # Create a boolean mask for the condition
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    
    # Use the boolean mask to select rows
    selected_rows = df[mask]
    
    return selected_rows

# Example usage:
# Assuming df is your DataFrame
data = {'Date': ['2023-01-01', '2023-01-15', '2023-01-25', '2023-02-05']}
df = pd.DataFrame(data)

selected_rows = select_rows_between_dates(df)

print(selected_rows)

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-25

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

The first and foremost library that needs to be imported to use the basic functions of Pandas is the pandas library itself. You typically import it using the following convention:
import pandas as pd